config/emacs/.config/emacs/init.org
#+Title: Emacs Config
#+Author: Mathis Albertzard
#+Description: My Config based on a starter config probably don't use this I have no clue
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

* Table of contents :toc:
- [[#early-init][Early Init]]
- [[#bootstrap][Bootstrap]]
- [[#package-manager][Package Manager]]
  - [[#leaf][Leaf]]
  - [[#keep-folders-clean][Keep folders clean]]
- [[#ui--eyecandy][UI / Eyecandy]]
  - [[#font][Font]]
  - [[#dim-inactive-windows][Dim Inactive windows]]
  - [[#scroll-margins][Scroll Margins]]
  - [[#modeline][Modeline]]
  - [[#theme][Theme]]
  - [[#which-key][Which Key]]
  - [[#indent-bars][Indent Bars]]
  - [[#highlight-current-line][Highlight Current line]]
  - [[#line-numbers][Line Numbers]]
  - [[#nerdicons][Nerdicons]]
  - [[#zoom-verschieben][Zoom (Verschieben)]]
- [[#core][Core]]
  - [[#sensible-defaults][Sensible Defaults]]
  - [[#start-emacs-server-on-startup][Start Emacs server on startup]]
  - [[#performance][Performance]]
  - [[#completion-systems][Completion Systems]]
  - [[#editing][Editing]]
  - [[#info-sources][Info Sources]]
- [[#features][Features]]
  - [[#layout][Layout]]
  - [[#vcs][VCS]]
  - [[#terminal][Terminal]]
  - [[#compilation][Compilation]]
  - [[#helper][Helper]]
- [[#langs][Langs]]
  - [[#web-mode][Web Mode]]
  - [[#pdf-tools][PDF Tools]]
  - [[#csv-mode][CSV Mode]]
  - [[#markdown][Markdown]]
  - [[#nix][Nix]]
  - [[#org][Org]]
  - [[#rust-mode][Rust Mode]]
  - [[#python][Python]]
  - [[#perl][Perl]]
- [[#keymaps][Keymaps]]
  - [[#meow][Meow]]
  - [[#window--buffer-nav][Window / Buffer Nav]]
  - [[#development][Development]]
  - [[#replacing-stuff][Replacing stuff]]
  - [[#hydra][Hydra]]
  - [[#search-stuff][Search Stuff]]
- [[#local-config][Local Config]]

* Early Init
#+begin_src emacs-lisp :tangle early-init.el
    (setq gc-cons-threshold 10000000)
    (setq byte-compile-warnings '(not obsolete))
    (setq warning-suppress-log-types '((comp) (bytecomp)))
    (setq native-comp-async-report-warnings-errors 'silent)
    (setq warning-minimum-level :error)

    ;; Silence stupid startup message
    (setq inhibit-startup-echo-area-message (user-login-name))

    ;; Default frame configuration: full screen, good-looking title bar on macOS
    (setq frame-resize-pixelwise t)
    (tool-bar-mode -1)			    ; All these tools are in the menu-bar anyway
    (setq default-frame-alist '((fullscreen . maximized)
                                (vertical-scroll-bars . nil)
                                (horizontal-scroll-bars . nil)
                                (ns-transparent-titlebar . t)))

    (when (and (fboundp 'startup-redirect-eln-cache)
               (fboundp 'native-comp-available-p)
               (native-comp-available-p))
      (startup-redirect-eln-cache
       (convert-standard-filename
        (expand-file-name  "var/eln-cache/" user-emacs-directory))))

    (setq package-enable-at-startup nil)
#+end_src

* Bootstrap
#+begin_src emacs-lisp
    ;;; -*- lexical-binding: t -*-
    (setq lexical-binding t)
#+end_src
* Package Manager
** Leaf
#+begin_src emacs-lisp
    (defvar my/use-nix-packages
      (getenv "IN_NIX_SHELL")
      "Non-nil when running inside Nix environment.")

    (require 'package)

    (unless my/use-nix-packages
      (add-to-list 'package-archives
                   '("gnu" . "https://elpa.gnu.org/packages/"))

      (add-to-list 'package-archives
                   '("melpa" . "https://melpa.org/packages/"))

      (package-initialize)

      (unless (package-installed-p 'leaf)
        (package-refresh-contents)
        (package-install 'leaf))

      (unless (package-installed-p 'leaf-keywords)
        (package-install 'leaf-keywords)))

    (require 'leaf)
    (leaf leaf-keywords :ensure t)
#+end_src
** Keep folders clean
#+begin_src emacs-lisp
    (unless my/use-nix-packages
      (leaf no-littering
    	:ensure t
    	:init
    	;; Set these BEFORE the package loads
    	(setq no-littering-etc-directory
    		  (expand-file-name "config/" user-emacs-directory))

    	(setq no-littering-var-directory
    		  (expand-file-name "data/" user-emacs-directory))
    	(no-littering-theme-backups)))
#+end_src
* UI / Eyecandy
** Font
#+BEGIN_src emacs-lisp
    (leaf emacs
      :init
      (set-face-attribute 'default nil :family "Noto Sans Mono")
      (set-face-attribute 'default nil
    					  :height 120
    					  :weight 'medium)
      (setq-default line-spacing 0.15))
#+END_SRC

** Dim Inactive windows
#+begin_src emacs-lisp
    (leaf dimmer
      :ensure t
      :custom
      ((dimmer-fraction . 0.3)
       (dimmer-adjustment-mode . :foreground)
       (dimmer-use-colorspace . :rgb))
      :global-minor-mode (dimmer-mode))
#+end_src

** Scroll Margins
#+BEGIN_src emacs-lisp
    (leaf emacs
      :ensure nil
      :custom
      ((scroll-conservatively . 10)
       (scroll-margin . 10)))
#+END_SRC

** Modeline
Use the right time format for the modeline
#+BEGIN_src emacs-lisp
    (leaf time
      :custom
      (display-time-24hr-format . t)
      (display-time-default-load-average . nil)
      :global-minor-mode (display-time-mode))
#+END_SRC

Hide some minor modes so the modeline is not that cluttert
#+BEGIN_src emacs-lisp
    (leaf minions
      :ensure t
      :global-minor-mode (minions-mode))
#+END_SRC

Install the doom modeline
#+BEGIN_src emacs-lisp
    (leaf doom-modeline
      :ensure t
      :custom
      ;; Keep it minimal
      ((doom-modeline-buffer-file-name-style . 'truncate-upto-project)
       (doom-modeline-icon . t)
       (doom-modeline-major-mode-icon . nil)
       (doom-modeline-minor-modes . nil)
       (doom-modeline-enable-word-count . nil)
       (doom-modeline-buffer-encoding . nil)
       (doom-modeline-percent-position . nil)
       (doom-modeline-indent-info . nil)
       (doom-modeline-checker-simple-format . t)
       (doom-modeline-vcs-max-length . 12)
       (doom-modeline-lsp . nil)
       (doom-modeline-env-version . nil))
      :global-minor-mode (doom-modeline-mode))
#+END_SRC

** Theme
#+BEGIN_src emacs-lisp
    (leaf doom-themes
      :ensure t
      :custom
      ((doom-themes-enable-bold . t)
       (doom-themes-enable-italic . t))
      :init
      (load-theme 'doom-material-dark t)
      (doom-themes-org-config))
#+END_SRC

** Which Key
#+BEGIN_src emacs-lisp
    (leaf which-key
      :custom
      ((which-key-popup-type . 'minibuffer)
       (which-key-idle-delay . 0.8)
       (which-key-min-display-lines . 1)
       (which-key-max-description-length . 25)
       (which-key-separator . " → ")
       (which-key-show-remaining-keys . nil))
      :global-minor-mode (which-key-mode))

#+END_SRC

** Indent Bars
#+begin_src emacs-lisp
    (leaf indent-bars
      :ensure t
      :hook prog-mode-hook
      :global-minor-mode (indent-bars-mode))
#+end_src

** Highlight Current line
#+begin_src emacs-lisp
    (leaf hl-line
      :hook (prog-mode-hook)
      :global-minor-mode (hl-line-mode))
#+end_src

** Line Numbers
#+BEGIN_src emacs-lisp
    (leaf emacs
      :custom
      (display-line-numbers-type . 'relative)
      :init
      (dolist (hook
    		   '(dired-mode-hook
    			 doc-view-presentation-mode-hook
    			 doc-view-mode-hook
    			 pdf-view-mode-hook
    			 term-mode-hook
    			 vterm-mode-hook
    			 org-mode-hook
    			 compilation-mode-hook))
    	(add-hook hook
    			  (lambda ()
    				(display-line-numbers-mode -1))))
      :global-minor-mode (global-display-line-numbers-mode))
#+end_src

** Nerdicons
#+BEGIN_src emacs-lisp
    (leaf nerd-icons
      :ensure t)
#+END_SRC

*** Completions
#+begin_src emacs-lisp
    (leaf nerd-icons-completion
      :ensure t
      :after marginalia nerd-icons
      :hook
      (marginalia-mode-hook . nerd-icons-completion-marginalia-setup)
      :global-minor-mode (nerd-icons-completion-mode))
#+END_SRC

#+begin_src emacs-lisp
    (leaf nerd-icons-corfu
      :ensure t
      :after corfu nerd-icons
      :init (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))
#+END_SRC

*** Dired
#+begin_src emacs-lisp
    (leaf nerd-icons-dired
      :ensure t
      :after dired nerd-icons
      :hook
      dired-mode-hook
      :global-minor-mode (nerd-icons-dired-mode))
#+END_SRC

** Zoom (Verschieben)
#+BEGIN_src emacs-lisp
    (leaf emacs
      :bind
      (("C-+" . text-scale-increase)
       ("C--" . text-scale-decrease)
       ("<C-wheel-up>" . text-scale-increase)
       ("<C-wheel-down>" . text-scale-decrease)))
#+END_SRC

* Core
** Sensible Defaults
No Trash Files
#+BEGIN_src emacs-lisp
    (leaf emacs
      :custom
      ((create-lockfiles . nil)
       (make-backup-files . nil)))
#+END_SRC

UI Stuff
#+BEGIN_src emacs-lisp
    (leaf emacs
      :custom
      (inhibit-startup-screen . t)
      :init
      (menu-bar-mode -1)
      (scroll-bar-mode -1)
      (tool-bar-mode -1))
#+END_SRC

Modern Input stuff
#+BEGIN_src emacs-lisp
    (leaf emacs
      :custom
      ;; UI
      ((inhibit-startup-screen . t)
       ;; Mouse / input
       (mouse-wheel-progressive-speed . nil)
       (ring-bell-function . #'ignore)

       ;; Editing
       (electric-indent-mode . nil)
       (truncate-lines . t)
       (tab-width . 4)

       ;; Dired
       (dired-kill-when-opening-new-dired-buffer . t)

       ;; Gnus
       (gnus-agent . nil)

       ;; Completion
       (read-extended-command-predicate . #'command-completion-default-include-p)

       ;; Dialogs / prompts
       (use-short-answers . t)
       (read-answer-short . t)
       (use-dialog-box . nil)

       ;; Exit confirmation
       (confirm-kill-emacs . #'y-or-n-p)

       ;; Auto-save visited buffers
       (auto-save-visited-interval . 2))

      :preface
      ;; Shorter prompts
      (defalias 'yes-or-no-p 'y-or-n-p)

      :bind
      ([escape] . keyboard-escape-quit)

      :hook
      (prog-mode-hook . (lambda ()
    					  (hs-minor-mode 1)))

      :init
      (xterm-mouse-mode 1)
      (blink-cursor-mode -1)

      ;; Editing helpers
      (delete-selection-mode 1)
      (electric-pair-mode 1)

      ;; Auto-save visited files
      (auto-save-visited-mode 1)

      ;; Auto-revert intentionally disabled
      (global-auto-revert-mode -1))
#+END_SRC

** Start Emacs server on startup
Ensure the Emacs server is started if not already running
#+begin_src emacs-lisp
    (leaf emacs
      :init
      (unless (server-running-p)
    	(server-start)))
#+END_SRC

** Performance
*** Compile External Packages
#+begin_src emacs-lisp
    (leaf compile-angel
      :ensure t
      :custom
      (compile-angel-verbose . nil)
      :global-minor-mode (compile-angel-on-load-mode))
#+end_src
*** Better GC

#+begin_src emacs-lisp
    (leaf gcmh
      :ensure t
      :hook
      (emacs-startup-hook)
      :custom
      ((gcmh-idle-delay . 'auto)
       (gc-cons-threshold . most-positive-fixnum)
       (gcmh-auto-idle-delay-factor . 10))
      :global-minor-mode (gcmh-mode))
#+END_SRC

*** View large files(VFL)
#+BEGIN_src emacs-lisp
    (leaf vlf
      :ensure t
      :init
      (require 'vlf-setup))
#+END_SRC

** Completion Systems
*** Completions at Point
#+BEGIN_src emacs-lisp
    (leaf orderless
      :ensure t
      :custom
      ((completion-styles . '(orderless basic))
       (completion-category-overrides . '((file (styles basic partial-completion))))))

    (leaf corfu
      :ensure t
      :after orderless
      :custom
      ((corfu-cycle . nil)
       (corfu-auto . t)
       (corfu-auto-prefix . 2)
       (corfu-popupinfo-delay . 0.15)
       (corfu-separator . ?\s)
       (corfu-count . 10)
       (corfu-scroll-margin . 4)
       (completion-ignore-case . t)
       (tab-always-indent . 'complete)
       (corfu-preview-current . nil)
       (completion-styles . '(orderless basic)))
      :global-minor-mode (global-corfu-mode corfu-popupinfo-mode))

    (leaf cape
      :ensure t
      :after corfu
      :init
      (add-to-list 'completion-at-point-functions
    			   #'cape-dabbrev)

      (add-to-list 'completion-at-point-functions
    			   #'cape-dict)

      (add-to-list 'completion-at-point-functions
    			   #'cape-file)

      (add-to-list 'completion-at-point-functions
    			   #'cape-elisp-block)

      (add-to-list 'completion-at-point-functions
    			   #'cape-keyword)

      (add-to-list 'completion-at-point-functions
    			   #'cape-history)

      (add-to-list 'completion-at-point-functions
    			   #'cape-elisp-symbol)
      (advice-add 'eglot-completion-at-point
    			  :around
    			  #'cape-wrap-buster))

    (leaf emacs
      :custom
      ((completion-category-overrides . '((eglot (styles orderless))
    									  (eglot-capf (styles orderless))))))
#+END_SRC
*** Vertical Completions
#+BEGIN_src emacs-lisp
    (leaf vertico
      :ensure t
      :bind (:vertico-map
    		 ("<tab>" . vertico-insert)
    		 ("C-j" . vertico-next)
    		 ("C-k" . vertico-previous)
    		 ("C-l" . vertico-exit))
      :custom
      (vertico-cycle . t)
      (vertico-count . 13)
      (vertico-resize . t)
      :global-minor-mode (vertico-mode))

    (leaf xref
      :custom
      (xref-show-definitions-function . #'xref-show-definitions-completing-read))

    (leaf marginalia
      :ensure t
      :after vertico
      :custom
      (marginalia-annotators . '(marginalia-annotators-heavy marginalia-annotators-light nil))
      :global-minor-mode (marginalia-mode))
#+END_SRC
*** Templates
#+BEGIN_src emacs-lisp
    (leaf tempel
      :ensure t
      :custom
      ((tempel-trigger-prefix . "<"))
      :config
      (defun my/tempel-setup-capf ()
    	(setq-local completion-at-point-functions
    				(cons #'tempel-complete
    					  completion-at-point-functions)))
      (add-hook 'conf-mode-hook #'my/tempel-setup-capf)
      (add-hook 'prog-mode-hook #'my/tempel-setup-capf)
      (add-hook 'text-mode-hook #'my/tempel-setup-capf)
      (defvar my/tempel-prefix-map
    	(let ((map (make-sparse-keymap)))
    	  (define-key map (kbd "i") #'tempel-insert)
    	  (define-key map (kbd "e") #'tempel-end)
    	  (define-key map (kbd "n") #'tempel-next)
    	  (define-key map (kbd "p") #'tempel-previous)
    	  (define-key map (kbd "k") #'tempel-kill)
    	  map)
    	"Tempel one-shot keymap.")
      (global-set-key (kbd "C-c i") my/tempel-prefix-map))

    (leaf tempel-collection
      :ensure t
      :after tempel)
#+END_SRC

